05-Numpy and Scipy/slides.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Numpy and Scipy Packages</title>
<meta name="author" content="(Sebastian Hahn)"/>

<link rel="stylesheet" href="../reveal.js/css/reveal.css"/>
<link rel="stylesheet" href="../reveal.js/css/theme/black.css" id="theme"/>
<link rel="stylesheet" href="../code_formatting.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="" data-background-size="" data-background-repeat="" data-background-transition="">
<h1>Numpy and Scipy Packages</h1> <h2>Sebastian Hahn</h2> <h2><a href="mailto:"></a></h2> <h2></h2>
</section>

<section>
<section id="slide-unnumbered-1">
<h2 id="unnumbered-1">Numpy</h2>
<ul >
<li>The <a href="http://www.numpy.org/">numpy package</a> is used in almost all numerical computation using Python</li>
<li>It is a package that provide high-performance vector, matrix and
higher-dimensional data structures</li>
<li>It is implemented in C and Fortran so when calculations are vectorized
(formulated with vectors and matrices), performance is very good</li>

</ul>

<p>
To use <b>numpy</b> you need to import the module:
</p>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #A52A2A; font-weight: bold;">import</span> numpy <span style="color: #A52A2A; font-weight: bold;">as</span> np
</pre>
</div>

</section>
<section id="slide-unnumbered-2">
<h3 id="unnumbered-2">Getting started</h3>
<ul >
<li><a href="http://www.scipy.org/scipylib/download.html">Getting Numpy</a></li>
<li><a href="http://docs.scipy.org/doc/">Numpy and scipy documentation page</a></li>
<li><a href="http://www.scipy.org/Tentative_NumPy_Tutorial">Numpy tutorial</a></li>
<li><a href="http://www.scipy.org/NumPy_for_Matlab_Users">Numpy for MATLAB Users</a></li>
<li><a href="http://www.scipy.org/Numpy_Functions_by_Category">Numpy functions by category</a></li>

</ul>
</section>
<section id="slide-unnumbered-3">
<h3 id="unnumbered-3">Creating numpy arrays</h3>
<p>
There are a number of ways to initialize new numpy arrays, for example from
</p>
<ul >
<li>a Python list or tuples</li>
<li>using functions that are dedicated to generating numpy arrays, such as
np.arange, np.linspace, etc.</li>
<li>reading data from files</li>

</ul>
</section>
<section id="slide-unnumbered-4">
<h4 id="unnumbered-4">From lists</h4>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #204A87;"># </span><span style="color: #204A87;">a vector: the argument to the array function is a Python list</span>
<span style="color: #0084C8; font-weight: bold;">v</span> = np.array<span style="color: #707183;">(</span><span style="color: #7388d6;">[</span>1, 2, 3, 4<span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>
<span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span>v<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; [1 2 3 4]
</pre>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #204A87;"># </span><span style="color: #204A87;">a matrix: the argument to the array function is a nested Python list</span>
<span style="color: #0084C8; font-weight: bold;">M</span> = np.array<span style="color: #707183;">(</span><span style="color: #7388d6;">[</span><span style="color: #909183;">[</span>1, 2<span style="color: #909183;">]</span>, <span style="color: #909183;">[</span>3, 4<span style="color: #909183;">]</span><span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>
<span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span>M<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; [[1 2]
 [3 4]]
</pre>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span><span style="color: #A020F0;">type</span><span style="color: #7388d6;">(</span>v<span style="color: #7388d6;">)</span>, <span style="color: #A020F0;">type</span><span style="color: #7388d6;">(</span>M<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
(&lt;type 'numpy.ndarray'&gt;, &lt;type 'numpy.ndarray'&gt;)
</pre>

<p>
The difference between the v and M arrays is only their shapes. We can get
information about the shape of an array by using the ndarray.shape property.
</p>
</section>
</section>
</div>
</div>

<script src="../reveal.js/lib/js/head.min.js"></script>
<script src="../reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: true,
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [

]
});
</script>
</body>
</html>
